Revit 2027 API
Dimension.TextPosition Property
 The position of the dimension text's drag point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ TextPosition { get; set; }
Public Property TextPosition As XYZ
	Get
	Set
public:
property XYZ^ TextPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member TextPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  Thrown when:
SpotDimension style type is SpotSlope.
Using equality formula.
Dimension style is ordinate.
 -or- Thrown when:
SpotDimension has more than one segments.
 -or-
Remarks
This property is not applicable to all dimensions. For example, it is not available for spot slope dimensions, multi-segments dimensions, dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property throws InvalidOperationException.
Example
    // Get the current text XYZ position
XYZ currentTextPosition = dimToModify.TextPosition;
// Calculate a new XYZ position by transforming the current text position
XYZ newTextPosition = Transform.CreateTranslation(new XYZ(0.0, 1.0, 0.0)).OfPoint(currentTextPosition);
// Set the new text position
dimToModify.TextPosition = newTextPosition;
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace